In [1]:
import numpy as np
import pandas as pd

In [2]:
# Creating a data frame:
df = pd.DataFrame(data=np.arange(0,12).reshape(4,3), columns = ["Col1","Col2","Col3"])
df

   Col1  Col2  Col3
0     0     1     2
1     3     4     5
2     6     7     8
3     9    10    11

In [3]:
# saving the data as a .csv file

df.to_csv("Test.csv")

## Accessing the elements in a dataframe (.loc, .iloc)

There are two way to access the element of a dataframe:\
    1. .loc\
    2. .iloc

### Row

In [8]:
df.loc[1] # Accessing the specific rwo with number

Col1    3
Col2    4
Col3    5
Name: 1, dtype: int32

In [9]:
df.iloc[1]

Col1    3
Col2    4
Col3    5
Name: 1, dtype: int32

### Column

In [13]:
df.iloc[:,:] # First : for row, 2nd : for column

   Col1  Col2  Col3
0     0     1     2
1     3     4     5
2     6     7     8
3     9    10    11

In [19]:
df.iloc[0:2,0:1] # Extracting first column and first two row.

   Col1
0     0
1     3

In [22]:
type(df.iloc[:,0:1]) # Extracting only the first columns

pandas.core.frame.DataFrame

In [24]:
df.iloc[:,0:1]

   Col1
0     0
1     3
2     6
3     9

In [23]:
# Alternative:
type(df['Col1'])

pandas.core.series.Series

In [25]:
df['Col1']

0    0
1    3
2    6
3    9
Name: Col1, dtype: int32

Same output column but the data type is different.

#### Selecting more than one columns

In [26]:
df.iloc[:,0:2]

   Col1  Col2
0     0     1
1     3     4
2     6     7
3     9    10

In [27]:
df[['Col1','Col2']]

   Col1  Col2
0     0     1
1     3     4
2     6     7
3     9    10

In [28]:
type(df.iloc[:,0:2])

pandas.core.frame.DataFrame

In [29]:
type(df[['Col1','Col2']])

pandas.core.frame.DataFrame

## Number of values by category level

In [30]:
# Creating a data frame:
df['Col4'] = ["A","A","B","C"] # Adding a column
df

   Col1  Col2  Col3 Col4
0     0     1     2    A
1     3     4     5    A
2     6     7     8    B
3     9    10    11    C

In [31]:
df['Col4'].value_counts()

A    2
B    1
C    1
Name: Col4, dtype: int64

In [32]:
df['Col4'].unique() # Unique category level in a column

array(['A', 'B', 'C'], dtype=object)